MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAML21J17B/mcu.h
/**
 * \brief Header file for ATSAML21J17B
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-24T16:15:00Z */
#ifndef _SAML21J17B_H_
#define _SAML21J17B_H_

// Header version uses Semantic Versioning 2.0.0 (https://semver.org/)
#define HEADER_FORMAT_VERSION "2.0.0"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (0)

/** \addtogroup SAML21J17B_definitions SAML21J17B definitions
  This file defines all structures and symbols for SAML21J17B:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_U_) || defined(_L_) || defined(_UL_)
#    error "Integer Literals macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#  define _U_(x) (x ## U)    /**< C code: Unsigned integer literal constant value */
#  define _L_(x) (x ## L)    /**< C code: Long integer literal constant value */
#  define _UL_(x) (x ## UL)  /**< C code: Unsigned Long integer literal constant value */

#else /* Assembler */

#  define _U_(x) x    /**< Assembler: Unsigned integer literal constant value */
#  define _L_(x) x    /**< Assembler: Long integer literal constant value */
#  define _UL_(x) x   /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */
/** @}  end of Atmel Global Defines */

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAML21J17B                                         */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M0PLUS Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /**< -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /**< -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /**< -13 Hard Fault, all classes of Fault    */
  SVCall_IRQn               =  -5, /**< -5  System Service Call via SVC instruction */
  PendSV_IRQn               =  -2, /**< -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /**< -1  System Tick Timer                   */
/******  SAML21J17B specific Interrupt Numbers ***********************************/
  MCLK_IRQn                 =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PAC PM SUPC (MCLK) */
  OSCCTRL_IRQn              =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PAC PM SUPC (OSCCTRL) */
  OSC32KCTRL_IRQn           =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PAC PM SUPC (OSC32KCTRL) */
  PAC_IRQn                  =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PAC PM SUPC (PAC) */
  PM_IRQn                   =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PAC PM SUPC (PM) */
  SUPC_IRQn                 =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PAC PM SUPC (SUPC) */
  WDT_IRQn                  =   1, /**< 1   Watchdog Timer (WDT)                */
  RTC_IRQn                  =   2, /**< 2   Real-Time Counter (RTC)             */
  EIC_IRQn                  =   3, /**< 3   External Interrupt Controller (EIC) */
  NVMCTRL_IRQn              =   4, /**< 4   Non-Volatile Memory Controller (NVMCTRL) */
  DMAC_IRQn                 =   5, /**< 5   Direct Memory Access Controller (DMAC) */
  USB_IRQn                  =   6, /**< 6   Universal Serial Bus (USB)          */
  EVSYS_IRQn                =   7, /**< 7   Event System Interface (EVSYS)      */
  SERCOM0_IRQn              =   8, /**< 8   Serial Communication Interface (SERCOM0) */
  SERCOM1_IRQn              =   9, /**< 9   Serial Communication Interface (SERCOM1) */
  SERCOM2_IRQn              =  10, /**< 10  Serial Communication Interface (SERCOM2) */
  SERCOM3_IRQn              =  11, /**< 11  Serial Communication Interface (SERCOM3) */
  SERCOM4_IRQn              =  12, /**< 12  Serial Communication Interface (SERCOM4) */
  SERCOM5_IRQn              =  13, /**< 13  Serial Communication Interface (SERCOM5) */
  TCC0_IRQn                 =  14, /**< 14  Timer Counter Control (TCC0)        */
  TCC1_IRQn                 =  15, /**< 15  Timer Counter Control (TCC1)        */
  TCC2_IRQn                 =  16, /**< 16  Timer Counter Control (TCC2)        */
  TC0_IRQn                  =  17, /**< 17  Basic Timer Counter (TC0)           */
  TC1_IRQn                  =  18, /**< 18  Basic Timer Counter (TC1)           */
  TC2_IRQn                  =  19, /**< 19  Basic Timer Counter (TC2)           */
  TC3_IRQn                  =  20, /**< 20  Basic Timer Counter (TC3)           */
  TC4_IRQn                  =  21, /**< 21  Basic Timer Counter (TC4)           */
  ADC_IRQn                  =  22, /**< 22  Analog Digital Converter (ADC)      */
  AC_IRQn                   =  23, /**< 23  Analog Comparators (AC)             */
  DAC_IRQn                  =  24, /**< 24  Digital-to-Analog Converter (DAC)   */
  PTC_IRQn                  =  25, /**< 25  Peripheral Touch Controller (PTC)   */
  AES_IRQn                  =  26, /**< 26  Advanced Encryption Standard (AES)  */
  TRNG_IRQn                 =  27, /**< 27  True Random Generator (TRNG)        */

  PERIPH_MAX_IRQn           =  27  /**< Max peripheral ID */
} IRQn_Type;
